
## Plan Result (management/base_apne1)

[CI link](https://github.com/tqer39/terraform-aws/actions/runs/4586921738)


<pre><code>Plan: 0 to add, 5 to change, 0 to destroy.</code></pre>

* Update
  * aws_iam_policy.deploy_allow_specifics
  * aws_iam_policy.deploy_deny_specifics
  * module.deploy_role.aws_iam_role.this
  * module.oidc_github_actions_id_provider.aws_iam_openid_connect_provider.this
  * module.tfstate_s3_bucket.module.s3_bucket.aws_s3_bucket.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_policy.deploy_allow_specifics will be updated in-place
  ~ resource "aws_iam_policy" "deploy_allow_specifics" {
        id        = "arn:aws:iam::577523824419:policy/deploy-allow-specifics"
        name      = "deploy-allow-specifics"
      ~ tags      = {
          - "pl:repository" = "LifeTechEase/terraform-aws" -> null
        }
      ~ tags_all  = {
          ~ "pl:repository"  = "LifeTechEase/terraform-aws" -> "tqer39/terraform-aws"
            # (5 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.deploy_deny_specifics will be updated in-place
  ~ resource "aws_iam_policy" "deploy_deny_specifics" {
        id        = "arn:aws:iam::577523824419:policy/deploy-deny-specifics"
        name      = "deploy-deny-specifics"
      ~ tags      = {
          - "pl:repository" = "LifeTechEase/terraform-aws" -> null
        }
      ~ tags_all  = {
          ~ "pl:repository"  = "LifeTechEase/terraform-aws" -> "tqer39/terraform-aws"
            # (5 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.deploy_role.data.aws_iam_policy.deploy_allow_specifics will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "deploy_allow_specifics" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = "deploy-allow-specifics"
      + path        = (known after apply)
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = (known after apply)
    }

  # module.deploy_role.data.aws_iam_policy.deploy_deny_specifics will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "deploy_deny_specifics" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = "deploy-deny-specifics"
      + path        = (known after apply)
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = (known after apply)
    }

  # module.deploy_role.data.aws_iam_policy_document.assume_role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "repo:tqer39/terraform-aws:*",
                ]
              + variable = "token.actions.githubusercontent.com:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::577523824419:oidc-provider/token.actions.githubusercontent.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.deploy_role.aws_iam_role.this will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - "token.actions.githubusercontent.com:sub" = "repo:tqer39/terraform-aws:*"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::577523824419:oidc-provider/token.actions.githubusercontent.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "management-terraform-aws-deploy"
      ~ managed_policy_arns   = [
          - "arn:aws:iam::577523824419:policy/deploy-allow-specifics",
          - "arn:aws:iam::577523824419:policy/deploy-deny-specifics",
        ] -> (known after apply)
        name                  = "management-terraform-aws-deploy"
      ~ tags                  = {
          - "pl:repository" = "LifeTechEase/terraform-aws" -> null
        }
      ~ tags_all              = {
          ~ "pl:repository"  = "LifeTechEase/terraform-aws" -> "tqer39/terraform-aws"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.oidc_github_actions_id_provider.aws_iam_openid_connect_provider.this will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "this" {
        id              = "arn:aws:iam::577523824419:oidc-provider/token.actions.githubusercontent.com"
      ~ tags            = {
          - "pl:repository" = "LifeTechEase/terraform-aws" -> null
        }
      ~ tags_all        = {
          ~ "pl:repository"  = "LifeTechEase/terraform-aws" -> "tqer39/terraform-aws"
            # (5 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.tfstate_s3_bucket.module.s3_bucket.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
        id                          = "terraform-tfstate-tqer39-577523824419-ap-northeast-1"
      ~ tags                        = {
          - "pl:repository" = "LifeTechEase/terraform-aws" -> null
        }
      ~ tags_all                    = {
          ~ "pl:repository"  = "LifeTechEase/terraform-aws" -> "tqer39/terraform-aws"
            # (5 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":194,"Program":"tfcmt","SHA1":"049fce3a6c368783dc5c2afeaccf9fe8b2c6ad5e","Target":"management/base_apne1","Vars":{},"WorkflowName":"Terraform - AWS - Management"} -->